package org.teaching.lecture3_inheritance.itvdn_tasks.task1;

/*
Создайте класс Printer.
В теле класса создайте метод void -->(String)<-- print(String value), который выводит на экран значение аргумента.
Реализуйте возможность того, чтобы в случае наследования от данного класса других классов, и вызове
соответствующего метода их экземпляра, строки, переданные в качестве аргументов методов,
выводились разными цветами.
Обязательно используйте приведение типов.
 */

public class Printer {

    public String print(String value){
        return value;
    }
}
